InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КлиентыВПеречнях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КлиентыВПеречнях</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПроверкиПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВключенияВПеречень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКлиентаВПеречне</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыКлиентаВПеречнях</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ПричиныПримененияПроцентнойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ПричиныПримененияПроцентнойСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВыделитьВЗалоговыйБилет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВыделитьВЗалоговыйБилет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Билет1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билет2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билет3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билет4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билет5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билет6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билет7</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныйКабинет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыКлиентаВПеречнях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыКлиентаВПеречнях</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исключен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ОтменаОперацииПоЗайму/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
        ДокументЗайма = Параметры.Документ;
		ЗалоговыйБилет = ДокументЗайма.ПредыдущаяОперация;
		Если ДокументЗайма.Проведен тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;	   
		ДатаДок = ДокументЗайма.Дата; 
		Ломбард = ДокументЗайма.Ломбард;  
		ОтветственныйПользователь = ДокументЗайма.ОтветственныйПользователь;
		ОтветственныйСотрудник = ДокументЗайма.ОтветственныйСотрудник;
		Комментарий = ДокументЗайма.Комментарий;
		Залогодатель = ДокументЗайма.Залогодатель; 
		СхемаКредитования = ДокументЗайма.СхемаКредитования; 
		СрокЗалога = ДокументЗайма.СрокЗалога;
		ОтказОтВыкупа = ДокументЗайма.ОтказОтВыкупа;  
		ПакетДоговоров = ДокументЗайма.ПакетДоговоров;  
		СтатусЗалогодателя = ДокументЗайма.СтатусЗалогодателя; 		
		ЗаполнитьСостояниеЗалоговогоБилета();
		ЗаполнитьТовары(); 
		НомераЗБ = ПолучитьНомераЗБ();
		//+Мельников 25.04.24 Отмена операции
		ОтмененныйДокумент = ДокументЗайма.ОтмененныйДокумент;
		Элементы.ВидОтменненойОперации.Заголовок = "Отмененная операция: " + """" + ДокументЗайма.ОтмененныйДокумент.ВидОперации + """";
		//-        
		БезналичнаяОплата = ОтмененныйДокумент.БезналичнаяОплата;
		Если НЕ БезналичнаяОплата Тогда  
			ДокументЗалогодателя = ДокументЗайма.ДокументЗалогодателя;
			ДопДокументы.Загрузить(ДокументЗайма.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
			ЗаполнитьКонтакнуюИнформациюЗалогодателя();
			ЗаполнитьИнформациюОДокументеЗалогодателя();   
		КонецЕсли;	
		Если БезналичнаяОплата Тогда
			РеестрПлатежей = ОтмененныйДокумент.РеестрПлатежей; 
			СуммаПлатежа = ОтмененныйДокумент.СуммаПлатежа;
			ДатаПлатежа = ОтмененныйДокумент.ДатаПлатежа;
			ИдентификаторПлатежа = ОтмененныйДокумент.ИдентификаторПлатежа; 
			РаспределениеПереплаты = ОтмененныйДокумент.РаспределениеПереплаты;
		КонецЕсли;	 
	Иначе		
		ДатаДок = ТекущаяДатаСеанса();   
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		//  	ОтветственныйПользователь = ТекПользователь;
		//Иначе
		//	ОтветственныйПользователь = ПараметрыСеанса.ТекущийСотрудник;
		//КонецЕсли;	
		ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
		ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	
		Если Параметры.Свойство("ЗалоговыйБилет") Тогда  
			ЗалоговыйБилет = Параметры.ЗалоговыйБилет;
			Ломбард = ЗалоговыйБилет.Ломбард;   
			Залогодатель = ЗалоговыйБилет.Залогодатель; 
			ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;
			СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;
			СрокЗалога = ЗалоговыйБилет.СрокЗалога;
			ОтказОтВыкупа = ЗалоговыйБилет.ОтказОтВыкупа;  
			ПакетДоговоров = ЗалоговыйБилет.ПакетДоговоров;
			ДопДокументы.Загрузить(ЗалоговыйБилет.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
		    ЗаполнитьКонтакнуюИнформациюЗалогодателя();
		   	ЗаполнитьИнформациюОДокументеЗалогодателя();
			СтатусЗалогодателя = ЗалоговыйБилет.СтатусЗалогодателя; 
			ЗаполнитьСостояниеЗалоговогоБилета();
		    ЗаполнитьТовары(); 
			НомераЗБ = ПолучитьНомераЗБ(); 
		КонецЕсли;  
	КонецЕсли;  
	ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
	                              
	ТоварыИтоги();
	Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументОтменыЗайма(ЗБ)
	ЗапросОтмена = Новый Запрос;  
	ЗапросОтмена.УстановитьПараметр("ПакетДоговоров", ПакетДоговоров);
	ЗапросОтмена.УстановитьПараметр("ЗалоговыйБилет", ЗБ);
	ЗапросОтмена.Текст ="ВЫБРАТЬ
	                    |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	                    |ГДЕ
	                    |	ЛБ_ОперацияПоЗалогу.ПакетДоговоров = &ПакетДоговоров
	                    |	И ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаЗалога)
	                    |	И ЛБ_ОперацияПоЗалогу.ПредыдущаяОперация = &ЗалоговыйБилет
	                    |АВТОУПОРЯДОЧИВАНИЕ";
	ВыборкаОтмена = ЗапросОтмена.Выполнить().Выбрать(); 
	Если ВыборкаОтмена.Следующий() Тогда
		Возврат ВыборкаОтмена.Ссылка;
	КонецЕсли;
	Возврат ПредопределенноеЗначение("Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка");
КонецФункции

&НаСервере
Процедура ЗаполнитьТовары() 
	Если ЗначениеЗаполнено(ПакетДоговоров) Тогда  
		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("ПакетДоговоров", ПакетДоговоров); 
		Запрос.Текст ="ВЫБРАТЬ
		              |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
		              |ИЗ
		              |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		              |ГДЕ
		              |	ЛБ_ОперацияПоЗалогу.ПакетДоговоров = &ПакетДоговоров
		              |	И ЛБ_ОперацияПоЗалогу.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
		              |АВТОУПОРЯДОЧИВАНИЕ";
		Выборка = Запрос.Выполнить().Выбрать(); 
		Ном = 0;
		Пока Выборка.Следующий() Цикл
			НоваяСтрП = ПакетДокументов.Добавить();			 
			НоваяСтрП.ЗалоговыйБилет = Выборка.Ссылка; 
			НоваяСтрП.ДокументЗайма = ПолучитьДокументОтменыЗайма(Выборка.Ссылка);
			НоваяСтрП.ВыделитьВЗалоговыйБилет = Перечисления.ЛБ_ВыделитьВЗалоговыйБилет.Получить(Ном); 
			 
			Ном = Ном + 1;
		КонецЦикла;	  		
	Иначе  
		НоваяСтрП = ПакетДокументов.Добавить();
		НоваяСтрП.ДокументЗайма = ДокументЗайма; 
		НоваяСтрП.ЗалоговыйБилет = ЗалоговыйБилет;
		НоваяСтрП.ВыделитьВЗалоговыйБилет = Перечисления.ЛБ_ВыделитьВЗалоговыйБилет.Билет1; 
	КонецЕсли;	  
	
	ТаблицаТоваров.Очистить();
	Для каждого СтрП Из ПакетДокументов Цикл    
		Для каждого стр Из СтрП.ЗалоговыйБилет.Товары Цикл
			НоваяСтр = ТаблицаТоваров.Добавить(); 
			НоваяСтр.Номерстроки = Стр.Номерстроки;    
			НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(СтрП.ЗалоговыйБилет, Стр.Номерстроки); //+МАН 03.12.24 Было: стр.ОбъектЗалога. Заявка 2904
			НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога; 
			НоваяСтр.СтатусОбъекта = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаДок, НоваяСтр.ОбъектЗалога, СтрП.ЗалоговыйБилет);
			НоваяСтр.СуммаСсуды = стр.СуммаСсуды;
			НоваяСтр.СуммаОценки = стр.СуммаОценкиМаксимальная; 
			НоваяСтр.ВыделитьВЗалоговыйБилет = СтрП.ВыделитьВЗалоговыйБилет; 
			НоваяСтр.НомерЗалоговогоБилета = СтрП.ДокументЗайма.НомерЗалоговогоБилета; 
		Конеццикла;	 
	Конеццикла;		
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогЗайи = ТаблицаТоваров.Итог("СуммаСсуды");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета() 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	//Если ЗначениеЗаполнено(ДокументЗайма) Тогда
	//	Запрос.УстановитьПараметр("Период", ДатаДок-1);
	//Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок); 
	//КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСостояний.Очистить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		//Начальные условия займа
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		//-
		
		//+Мельников 25.04.24
		//Состояние залогового билета до операции отмены
		ОтборДоОтмены = Новый Структура;
		ОтборДоОтмены.Вставить("Регистратор", ДокументЗайма.ОтмененныйДокумент);
		
		СтатусОтмененнойОперации = ТаблицаЗапроса.НайтиСтроки(ОтборДоОтмены).Получить(0);
		
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до операции отмены";
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = СтатусОтмененнойОперации.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтатусОтмененнойОперации.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтатусОтмененнойОперации.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтатусОтмененнойОперации.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтатусОтмененнойОперации.ДатаНачалаРасчетаПроцентов;
		
		Если ДокументЗайма.ОтмененныйДокумент.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога Тогда
			
			Отбор = Новый структура;
			Отбор.Вставить("КлючСтроки", 3);
			Строки = ДокументЗайма.ТаблицаСостоянийОтмененного.НайтиСтроки(Отбор);  
			Стр = Строки.Получить(0);
			
			Элементы.ТаблицаСостоянийСуммаПроцентовДолг.Видимость = Истина;
			
			НоваяСтр.СуммаПроцентовДолг = Стр.СуммаПроцентовДолг;
			
		КонецЕсли;
		
		//Если ДокументЗайма.ОтмененныйДокумент.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов Тогда
		//	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
		//	
		//	Если СтруктураП <> Неопределено Тогда
		//	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		//		ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
		//	Иначе
		//		ПредельноеЗначениеПроцентов = 0;
		//	КонецЕсли;

		//	ОбъектОтмененнойОперации = ДокументЗайма.ОтмененныйДокумент.ПолучитьОбъект();
		//	ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументЗайма.ОтмененныйДокумент, ЗалоговыйБилет); 
		//	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
		//	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
		//	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ОбъектОтмененнойОперации, НоваяСтр.ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр); 
		//КонецЕсли;
		
		НоваяСтр.ПроцентнаяСтавка = ?(ДокументЗайма.ОтмененныйДокумент.ПроцентнаяСхема <> 0, ДокументЗайма.ОтмененныйДокумент.ПроцентнаяСхема, ЗалоговыйБилет.ПроцентнаяСхема);
		НоваяСтр.СуммаПроцентовДень = СтатусОтмененнойОперации.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтатусОтмененнойОперации.СуммаПроцентовСрок;
		//-
		
		//Состояние залогового билета после операции отмены
		ОтборПослеОтмены = Новый Структура;
		ОтборПослеОтмены.Вставить("Регистратор", ДокументЗайма);
		
		Попытка
			СтатусОтмененнойОперации = ТаблицаЗапроса.НайтиСтроки(ОтборПослеОтмены).Получить(0);

			НоваяСтр = ТаблицаСостояний.Добавить();
			НоваяСтр.Состояние = "Состояние залогового билета после операции отмены";
			НоваяСтр.КлючСтроки = 3;  	                                          
			НоваяСтр.Статус = СтатусОтмененнойОперации.СтатусЗалоговогоБилета;
			НоваяСтр.СуммаЗайма = СтатусОтмененнойОперации.СуммаЗайма;
			НоваяСтр.ДатаВозврата = СтатусОтмененнойОперации.ДатаВыкупа;
			НоваяСтр.ДатаВозвратаЛьготная = СтатусОтмененнойОперации.ДатаВыкупаЛьготныйСрок; 
			НоваяСтр.ДатаНачалаРасчета = СтатусОтмененнойОперации.ДатаНачалаРасчетаПроцентов;
			НоваяСтр.ПроцентнаяСтавка = ?(ДокументЗайма.ПроцентнаяСхема <> 0, ДокументЗайма.ПроцентнаяСхема, ЗалоговыйБилет.ПроцентнаяСхема);
			НоваяСтр.СуммаПроцентовДень = СтатусОтмененнойОперации.СуммаПроцентовДень;
			НоваяСтр.СуммаПроцентовСрок = СтатусОтмененнойОперации.СуммаПроцентовСрок; 
		Исключение
		КонецПопытки;	
		//-
		//-Мельников
	КонецЕсли;
	
	//ЗаполнитьСтрокуСостоянияПослеОплаты(ДокументЗайма.Выкуп);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомераЗБ() 
	ИнфНомераЗБ = "";  
	ТоварыДоп = ТаблицаТоваров.Выгрузить();
	ТоварыДоп.Свернуть("НомерЗалоговогоБилета");
	Для каждого СтрДоп из ТоварыДоп Цикл 
		ИнфНомераЗБ = ИнфНомераЗБ + ?(Пустаястрока(ИнфНомераЗБ), "", ", ") + СокрЛП(стрДоп.НомерЗалоговогоБилета);
	Конеццикла;	  
	ИнфНомераЗБ = ИнфНомераЗБ + " от " + Формат(ЗалоговыйБилет.Дата, "ДЛФ=DDT");
	Возврат ИнфНомераЗБ; 
КонецФункции	          

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ДопДокументы.Количество() = 0 Тогда
		Элементы.ГруппаДопДокумент.Показать(); 
	Иначе
		Элементы.ГруппаДопДокумент.Видимость = Ложь; //+Мельников 27.04.24
	КонецЕсли;	
	
	Если НеРедактировать Тогда  
		//Элементы.Редактировать.Видимость = Истина;
		Элементы.ОтменитьЗайм.Доступность = ложь;
	    Элементы.ОсновнаяПанель.ТолькоПросмотр = Истина; 
	Иначе
		Элементы.СтраницаЗаемщик.ТолькоПросмотр = Истина;  
	КонецЕсли;	
		
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
	УстановитьВидимость();
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(?(СписокЗалоговыхБилетов.Количество() = 0, неопределено, СписокЗалоговыхБилетов));
КонецПроцедуры

&НаСервере
Процедура ТоварыИтоги()   
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
   	ТоварыИтогСсуда = ТаблицаТоваров.Итог("СуммаСсуды");
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИнфорациюОЗалогодателе(Параметры)
	Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		ДокументЗалогодателя = Параметры.ДокументЗалогодателя; 
		ЗаполнитьИнформациюОДокументеЗалогодателя();
	КонецЕсли;	
	ЗаполнитьКонтакнуюИнформациюЗалогодателя();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Информация = "";
		Информация = СокрЛП(Выборка.ВидДокумента);
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНачалоДействия), " действует с " + Формат(Выборка.ДокументНачалоДействия,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСрокДействия), " по " + Формат(Выборка.ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
		Паспорт = Информация;
   	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		КонтактнаяИнформация = "";
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Гражданство), СокрЛП(Выборка.Гражданство), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Пол), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "пол.: " + Строка(Выборка.Пол), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.ДатаРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "дата рожд.: " +  Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy"), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.МестоРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "место рожд.: " +  СокрЛП(Выборка.МестоРождения), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Телефон), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "тел.: " + СокрЛП(Выборка.Телефон), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Email), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "email: " + СокрЛП(Выборка.Email), "");
		Если ЗначениеЗаполнено(Выборка.АдресПоПрописке) Тогда
			АдресК = "адрес по прописке: " + СокрЛП(Выборка.АдресПоПрописке);
		Иначе  
			АдресК = "фактический адрес: " + СокрЛП(Выборка.ФактическийАдрес);
		КонецЕсли;	
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + АдресК;

		ФИО = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		Гражданство = Выборка.Гражданство; 
		ДатаРождения = Выборка.ДатаРождения;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимость()
	Если Гражданство = Справочники.СтраныМира.Россия Тогда 
		Элементы.ГруппаДопДокумент.Видимость = Ложь;
	Иначе 
		Элементы.ГруппаДопДокумент.Видимость = Истина;
	КонецЕсли;  
	Если БезналичнаяОплата Тогда 
		Элементы.ГруппаЗаемщик.Видимость = Ложь; 
		Элементы.ГруппаДопДокумент.Видимость = Ложь;
		Элементы.Редактировать.Видимость = Ложь;  
		Элементы.ГруппаБезНал.Видимость = Истина; 
		ИнформацияРеестр = "";  
		Если РаспределениеПереплаты Тогда
			ИнформацияРеестр = ИнформацияРеестр + "Уточнение переплаты: ";
		КонецЕсли;
		Если ЗначениеЗаполнено(РеестрПлатежей) Тогда
			ИнформацияРеестр = ИнформацияРеестр + "Реестр платежей № " + СокрЛП(РеестрПлатежей.НомерРеестра);
			ВидПлатежа = ?(РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет, " п/п ", " идентификатор ");   
		Иначе
			ВидПлатежа = " идентификатор ";
		КонецЕсли;	 
		Если ЗначениеЗаполнено(ИдентификаторПлатежа) Тогда
			ИнформацияРеестр = ИнформацияРеестр + ВидПлатежа + СокрЛП(ИдентификаторПлатежа);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДатаПлатежа) Тогда
			ИнформацияРеестр = ИнформацияРеестр + " от " + Формат(ДатаПлатежа, "ДЛФ=DT");
		КонецЕсли;	   
		Если НЕ СуммаПлатежа = 0 Тогда
			ИнформацияРеестр = ИнформацияРеестр + " сумма платежа " + СокрЛП(Формат(СуммаПлатежа, "ЧЦ=15; ЧДЦ=2")) + " руб."; 
			Если НЕ ОтмененныйДокумент.СуммаОплаты = СуммаПлатежа Тогда  
				ИнформацияРеестр = ИнформацияРеестр + " переплата " + СокрЛП(Формат(СуммаПлатежа-ОтмененныйДокумент.СуммаОплаты, "ЧЦ=15; ЧДЦ=2")) + " руб.";
			КонецЕсли;	
		КонецЕсли;	
		Элементы.ДекорацияРеестр.Заголовок = ИнформацияРеестр;
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура КарточкаПлательщика(Команда)
	СтандартнаяОбработка = ложь;
	Если ЗначениеЗаполнено(Залогодатель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Залогодатель);
		ПараметрыФормы.Вставить("Дата", ДатаДок);	
		ПараметрыФормы.Вставить("ТолькоПросмотр", истина);
		ПараметрыФормы.Вставить("НеРедактировать", истина); 
		
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран плательщик!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(?(СписокЗалоговыхБилетов.Количество() = 0, неопределено, СписокЗалоговыхБилетов));
КонецПроцедуры 

&НаСервере
Функция ПроверитьКлиентаПоПеречням()
	РезультатПроверки = Истина;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)) КАК ЛБ_КлиентыВПеречняхСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
			Сообщить("Клиент найден в перечне террористов. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			РезультатПроверки = Ложь;
		ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
			Сообщить("Клиент найден в перечне ФРОМУ. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			РезультатПроверки = Ложь;
        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
			Сообщить("Клиент найден в списке МВК. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			РезультатПроверки = Ложь;	
		КонецЕсли;	
	Конеццикла;
	Возврат РезультатПроверки;
КонецФункции	

&НаСервере
Функция ПроверкаКлиента() 
	ВсеОК = Истина;
	
	ВозрастКлиента = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	Если ВозрастКлиента  < 18 Тогда
	    Сообщить("Клиенту " + Строка(ВозрастКлиента) + " лет, работа с несовершеннолетними клиентами не осуществляется!", СтатусСообщения.Важное);
		ВсеОК = ложь;
	КонецЕсли;	
	
	Если НЕ ПроверитьКлиентаПоПеречням() Тогда
		ВсеОК = ложь;
	КонецЕсли; 
			
	Возврат ВсеОК;
КонецФункции    

&НаКлиенте
Процедура История(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
// Проверяет заполнение полей залогового билета
//
// Параметры
//  Нет
//
// Возвращаемое значение
//  Булево - результат проверки
//
Функция ПроверкаЗаполнения()
	
	Результат = Истина;       
	//Если НЕ ЗначениеЗаполнено(Ломбард) тогда
	//	Результат = Ложь;
	//	Сообщить("Не выбран ломбард!",СтатусСообщения.Внимание);
	//КонецЕсли; 
	//
	//Если НЕ ЗначениеЗаполнено(Фамилия) тогда
	//	Результат = Ложь;
	//	Сообщить("Не заполнена фамилия клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;  
	//
	//Если НЕ ЗначениеЗаполнено(Имя) тогда
	//	Результат = Ложь;
	//	Сообщить("Не заполнено имя клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;  
	//
	//Если НЕ ЗначениеЗаполнено(ДатаРождения) тогда
	//	Результат = Ложь;
	//	Сообщить("Не заполнена дата рождения клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(Гражданство) тогда
	//	Результат = Ложь;
	//	Сообщить("Не выбрано гражданство клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(СхемаКредитования) тогда
	//	Результат = Ложь;
	//	Сообщить("Не выбрана схема кредитования!",СтатусСообщения.Внимание);
	//КонецЕсли;    
	//
	//Если ПроцентныеСтавкиПоПериодам.Количество() = 0 Тогда
	//	Результат = Ложь;
	//	Сообщить("Не определены процентные ставки!",СтатусСообщения.Внимание);
	//КонецЕсли;  

	//Если НЕ ТаблицаТоваров.Количество() Тогда		
	//	Результат = Ложь;
	//	Сообщить("Состав залога не указан!",СтатусСообщения.Внимание);		
	//КонецЕсли;    
	//
	//Если Не Результат Тогда
	//	возврат Результат;
	//КонецЕсли;	
	//
	//Если Результат Тогда
	//	Если ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
	//		Если ПустаяСтрока(ДокументКодПодразделения) Тогда
	//			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить код подразделения!");
	//			Результат = ложь;
	//		КонецЕсли;	
	//		Если ПустаяСтрока(ДокументКемВыдан) Тогда
	//			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить кем выдан!");
	//			Результат = ложь;
	//		КонецЕсли;	
	//	КонецЕсли;
	//	Если ((ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
	//	(ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) Тогда
	//	    Если ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда 			    
	//			Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
	//			Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
	//				Если ЗначениеЗаполнено(ДокументЗайма) Тогда
	//					Сообщить("Документ найден в списке недействительных паспортов!");
	//				    Результат = ложь; 
	//				КонецЕсли;	
	//			ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, ДокументДатаВыдачи) Тогда
	//				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//			    Результат = ложь;	
	//			КонецЕсли;	
	//		ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, ДокументДатаВыдачи) Тогда
	//			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//		    Результат = ложь;   
	//		КонецЕсли;	
	//	ИначеЕсли (ДокументВид = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(ДатаРождения) Тогда
	//		Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//	    Результат = ложь;
	//	КонецЕсли;	
	//	Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(ДокументВидДокументаЗалогодателя, ДокументВид) тогда
	//		Если НЕ ЗначениеЗаполнено(ДокументСрокДействия) Тогда
	//			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить срок действия!");
	//	        Результат = ложь;
	//		ИначеЕсли ДокументСрокДействия < НачалоДня(ДатаДок) Тогда
	//			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//	        Результат = ложь;
	//		КонецЕсли;	
	//	КонецЕсли;	 
	//	Если НЕ Гражданство = Справочники.СтраныМира.Россия Тогда
	//		Отбор = Новый Структура; 
	//		Отбор.Вставить("Клиент", Залогодатель);
	//		Строки = ДопДокументы.НайтиСтроки(Отбор);
	//		Если Строки.Количество() = 0 Тогда 
	//			Сообщить("Не выбран документ удостоверяющий право пребывания клиента на территории РФ!");
	//	        Результат = ложь;
	//		Иначе                  
	//			ЕстьДокументГражданствоНЕРФ = ложь;
	//			Для каждого Стр Из Строки Цикл
	////				Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Стр.ДокументЗалогодателя, Стр.ВидДокумента) тогда 
	////					Если НЕ ЗначениеЗаполнено(ДокументСрокДействия) Тогда
	////						Продолжить;
	////					ИначеЕсли ДокументСрокДействия <	НачалоДня(ДатаДок) Тогда
	////						Продолжить;
	////					КонецЕсли;	
	////                    ГражданствоНЕРФ = Истина;
	////					Прервать;  
	////				Иначе
	////					ГражданствоНЕРФ = Истина;
	////					Прервать; 
	////				КонецЕсли;	
					//Если Стр.ДокументГражданство = Гражданство Тогда
					//	ЕстьДокументГражданствоНЕРФ = Истина;
					//	Прервать; 
					//КонецЕсли;	
	//			КонецЦикла;	
	//			Если НЕ ГражданствоНЕРФ Тогда
	//				Сообщить("У клиента нет действующего документа, удостоверяющего право пребывания на территории РФ!");
	//				Результат = ложь;
	//			КонецЕсли;	
	//		КонецЕсли;	
	//	КонецЕсли;	  
	//КонецЕсли;
	//
	//Если Результат Тогда  
	//	
	//
	//	
	//	Для каждого СтрокаТабличнойЧасти Из Товары Цикл
	//		
	//		Результат = Результат 
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидИзделия)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Проба)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Описание)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаОценки)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаСсуды); 
	//		
	//		Если НЕ Результат Тогда
	//		    Сообщить("В строке № " + СтрокаТабличнойЧасти.НомерСтроки +  " не заполнены обязательные поля", СтатусСообщения.Внимание);
	//            Результат = ложь;
	//			Прервать;
	//		КонецЕсли;	   
	//		
	//			
	//		Если СтрокаТабличнойЧасти.ЕстьДопМеталлы И НЕ СтрокаТабличнойЧасти.ЕстьЭтикетка Тогда   
	//			Сообщить("В строке № " + Строка(СтрокаТабличнойЧасти.НомерСтроки) + " есть дополнительные металлы, но нет этикетки!");
	//	        Результат = ложь;		
	//		КонецЕсли;
	//					
	//		Если СтрокаТабличнойЧасти.Именник = Перечисления.ЛБ_Именник.Да тогда
	//			Если ПустаяСтрока(СтрокаТабличнойЧасти.ДанныеИменника) Тогда
	//				Сообщить("Если именник РФ, то необходимо заполнить данные именника.");
	//				Результат = ложь;
	//			КонецЕсли;	
	//		КонецЕсли;  
	//		
	//		Если СтрокаТабличнойЧасти.ЕстьДеффекты тогда
	//			Если ПустаяСтрока(СтрокаТабличнойЧасти.Дефекты) Тогда
	//				Сообщить("Если в изделии есть дефекты, то необходимо их описать.");
	//				Результат = ложь;
	//			КонецЕсли;	
	//		КонецЕсли;  
	//		
	//					
	//		Если НЕ Результат Тогда
	//			
	//			Прервать;
	//			
	//		КонецЕсли; 
	//		
	//	КонецЦикла; 
	//	
	//КонецЕсли;
				
	Возврат Результат;
	
КонецФункции // ПроверкаЗаполнения() 

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда                  
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения залоговый билет " + СокрЛП(Документ.НомерЗалоговогоБилета) + ". Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура Редактировать(Команда)   
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Для каждого стрП Из ПакетДокументов цикл   
			Если ЗначениеЗаполнено(стрП.ДокументЗайма) тогда 
				Результат = СнятьСПроведения(стрП.ДокументЗайма);
				Если НЕ Результат тогда  
					ПроверкаМожноРедактировать = Ложь;
					Прервать;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Этаформа.ТолькоПросмотр = Ложь;
			Этаформа.Открыть();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать; 
	Элементы.СтраницаЗаемщик.ТолькоПросмотр = Истина;  
	Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь; 
	Элементы.ОтменитьЗайм.Доступность = Истина;
КонецПроцедуры

&НаСервере
Функция МакетПечатнойФормы(ШаблонДокумента)
	
	Если НЕ ТипЗнч(ШаблонДокумента.ХранилищеШаблона.Получить()) = Тип("ДвоичныеДанные") Тогда
		Сообщить("Шаблон печати анкеты не загружен!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ШаблонДокумента.ХранилищеШаблона.Получить();
	 
КонецФункции 

&НаКлиенте
Процедура ПечатьЗалоговыйБилет(Команда)
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ЗалоговыйБилет");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("doc"); 
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		//Word.Documents.Open(ИмяВременногоФайла);   
		Word.Documents.add(ИмяВременногоФайла);
	    ActiveDocument = Word.Application.Documents(1);
	    ActiveDocument.Activate();
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки;
	
	//ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента();
	//
	//ActiveDocument = Word.ActiveDocument;
	//ВывестиПараметрНаПечать(ActiveDocument, "ТекДата",              Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	//ВывестиПараметрНаПечать(ActiveDocument, "ФИО",                  СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), ""));
	//ВывестиПараметрНаПечать(ActiveDocument, "ДатаРождения",         Формат(ДатаРождения, "ДФ=dd.MM.yyyy"));
	//ВывестиПараметрНаПечать(ActiveDocument, "ПаспортныеДанные",     ПаспортныеДанныеСтруктура.ПаспортныеДанные);
	//ВывестиПараметрНаПечать(ActiveDocument, "АдресМестаЖительства", ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес)); 
	//ВывестиПараметрНаПечать(ActiveDocument, "Согласен",             ?(Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский"), "согласна", "согласен"));
	
	Word.Visible = Истина;
	Word.WindowState = 2;
	Word.WindowState = 1;
КонецПроцедуры  

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно; 
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик;
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаЗаемщик Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры
  
&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	Если ДатаДок < ЗалоговыйБилет.Дата Тогда		
		Предупреждение("Дата текущей операции не может быть меньше даты залогового билета.", 60);
	    ДатаДок = ТекДатаДок;
    Иначе
		Часы = (ДатаДок - ЗалоговыйБилет.Дата)/3600;   
		Если Часы > 1 Тогда 
		   Предупреждение("Отмена залогового билета со времени выдачи которого прошло больше 1 часа невозможна.", 60); 
		   ДатаДок = ТекДатаДок;
	    КонецЕсли; 
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДатаДок = ДатаДок;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ДатаДок);	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//+Мельников 25.04.24 Отмена операции
&НаКлиенте
Процедура ОтмененныйДокументНажатие(Элемент, СтандартнаяОбработка)

	ВидОперации = ПолучитьВидОперации(ОтмененныйДокумент);
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтмененныйДокумент);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОплатыПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,);	  
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтмененныйДокумент);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ИзъятиеОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтмененныйДокумент);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ВозвратОбъектовЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтмененныйДокумент);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ОстановкаНачисленияПроцентов", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтмененныйДокумент);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ВыдачаЗалога") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ОтмененныйДокумент);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыдачиЗалога", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	Иначе                           
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОперации(Ссылка)
	Возврат Ссылка.ВидОперации;
КонецФункции
//-Мельников
